Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Let's create the `Legume` class which will be serialized as JSON, following the same model as for our `Fruit` class:
zh_cn: 让我们创建一个将被序列化为 JSON 的 `Legume` 类，遵循与我们的 `Fruit` 类相同的模型：

source: Let's do that and follow the same steps as before:
zh_cn: 让我们这样做，并遵循与之前相同的步骤：

source: Let's explore briefly different producer/consumer patterns and how to implement them using Quarkus:
zh_cn: 让我们简单展示一下不同的生产者/消费者模式以及如何使用Quarkus来实现它们：

source: Let's imagine the following process:
zh_cn: 让我们假设以下过：

source: Let's imagine you receive `Fruit` objects. For simplicity purposes, our `Fruit` class is pretty simple:
zh_cn: 让我们假设您收到了 `Fruit` 对象。为了简单起见，我们的 `Fruit` 类非常简单：

source: Let's imagine your application receives `Message<Double>`. You can consume the payload directly:
zh_cn: 让我们想象一下你的应用程序接收 `Message<Double>` 。你可以直接消费该有效载荷：

source: Let's modify the application and add a companion bean. Create the `src/main/java/org/acme/GreetingService.java` file with the following content:
zh_cn: 让我们修改应用程序并添加一个bean。创建 `src/main/java/org/acme/GreetingService.java` 文件，内容如下。

source: Let's now implement a new HTTP endpoint that queries the Wikipedia API to retrieve the pages about Quarkus in the different languages. Add the following method to the `VertxResource` class:
zh_cn: 现在，让我们实现一个新的 HTTP 端点，它通过查询 Wikipedia API 以检索不同语言有关 Quarkus 的页面。 将以下方法添加到 `VertxResource` 类中:

source: Let's revisit a greeting HTTP endpoint and use asynchronous message passing to delegate the call to a separated bean. It uses the request/reply dispatching mechanism. Instead of implementing the business logic inside the JAX-RS endpoint, we are sending a message. Another bean consumes this message, and the response is sent using the _reply_ mechanism.
zh_cn: 让我们重新访问一个响应的HTTP端点，并使用异步消息传递将调用委托给一个单独的bean。它使用了request/reply的调度机制。我们不是在JAX-RS端点内实现业务逻辑，而是发送一个消息。另一个Bean使用这个消息，并使用 _回复_ 机制发送响应。

source: Let's say we want to test the following processor application:
zh_cn: 假设我们想测试以下的处理器应用：

source: Let's start by implementing the `/api/users/me` endpoint. As you can see from the source code below it is just a regular JAX-RS resource:
zh_cn: 让我们从实现 `/api/users/me` 端点开始。从下面的源代码可以看出，它只是一个普通的JAX-RS资源：

source: Let's start with the `Fruit` entity.Create the `src/main/java/org/acme/hibernate/orm/panache/Fruit.java` file with the following content:
zh_cn: 让我们从 `Fruit` 实体开始。创建 `src/main/java/org/acme/hibernate/orm/panache/Fruit.java` 文件，内容如下:

source: Let's start with the `getAll` method. The `getAll` method returns all the fruits stored in the database. In the `FruitResource`, add the following code:
zh_cn: 让我们从 `getAll` 方法开始。 `getAll` 方法返回存储在数据库中的所有水果对象。在 `FruitResource` 中，添加以下代码：

source: Let's try this. In a terminal, run:
zh_cn: 让我们试试这个。 在终端中，运行以下命令:

source: Let's write a simple test that shows this off to load some static resources. First create a simple HTML file in `src/main/resources/META-INF/resources/index.html` :
zh_cn: 让我们写一个简单的测试来演示如何加载一些静态资源。首先创建一个简单的HTML文件 `src/main/resources/META-INF/resources/index.html` ：

source: Let’s go to the quark of things.
zh_cn: 我们来看看quark的事情。

source: Let’s start with the basics: HTTP microservices. In this context, you need to develop an HTTP endpoint, often called REST or CRUD. You process incoming HTTP requests, and to do so you often need to rely on other services, such as databases, or another HTTP service.
zh_cn: 让我们从最基本的开始：HTTP微服务。在这种情况下，你需要开发一个HTTP端点，通常称为REST或CRUD。你处理传入的HTTP请求，而要做到这一点，你往往需要依靠其他服务，如数据库，或另一个HTTP服务。

source: Let’s take a very simple application handling <em>elements</em> from the periodic table. The code would be something like:
zh_cn: 让我们来看看一个非常简单的处理周期表中<em>元素</em>的应用程序。代码将是这样的：

source: License
zh_cn: 许可证

source: Like most Quarkus extensions, the Quarkus AWS Lambda HTTP/REST extensions support Live Coding.
zh_cn: 与大多数Quarkus扩展一样，Quarkus AWS Lambda HTTP/REST扩展支持实时编码。

source: List all the configuration properties per extensions
zh_cn: 列出每个扩展的所有配置属性

source: Listening on a Unix domain socket allows us to dispense with the overhead of TCP if the connection to the quarkus service is established from the same host. This can happen if access to the service goes through a proxy which is often the case if you're setting up a service mesh with a proxy like Envoy.
zh_cn: 如果与 quarkus 服务的连接是从同一主机建立的，那么侦听 Unix 域套接字允许我们免除 TCP 的开销。如果通过代理访问服务可能会发生这种情况，如果您使用 Envoy 等代理设置服务网格，通常会出现这种情况。

source: Listening to a Unix Domain Socket
zh_cn: 监听Unix Domain Socket

source: Live Coding
zh_cn: 实时编码

source: Live Coding and Simulating AWS Lambda Environment Locally
zh_cn: 实时编码和本地模拟AWS Lambda环境

source: Live Coding and Unit/Integration Testing
zh_cn: 实时编码和单元/集成测试

source: Live Coding with Quarkus
zh_cn: 使用Quarkus进行实时编码

source: Live reload
zh_cn: 实时重载

source: Local Public Key
zh_cn: 本地公钥

source: Local verification
zh_cn: 本地验证

source: Local verification or introspection
zh_cn: 本地验证或自查

source: Location of the verification key which can point to both public and secret keys. Secret keys can only be in the JWK format. Note that 'mp.jwt.verify.publickey.location' will be ignored if this property is set.
zh_cn: 验证密钥的位置，可以指向公钥和秘钥。秘密密钥只能是JWK格式。注意，如果设置了这个属性，`mp.jwt.verify.publickey.location` 将被忽略。

source: Lock management
zh_cn: 锁管理

source: Log Docker into your ECR registry and push the Docker image to it
zh_cn: 将Docker记录到你的ECR注册表中，并将Docker镜像推送到其中

source: Log in as the `admin` user to access the Keycloak Administration Console. Username should be `admin` and password `admin`.
zh_cn: 以 `admin` 用户身份登录，访问Keycloak管理控制台。用户名应该是 `admin` ，密码是 `admin` 。

source: Logging
zh_cn: 日志

source: Logging with Native Image
zh_cn: 使用原生镜像日志

source: Login as `alice` (password: `alice`) who has a `user` role
zh_cn: 以 `alice` （密码： `alice` ）的身份登录，他的角色(role)是 `user`

source: Login as `alice` (password: `alice`) who only has a `User Permission` to access the `/api/users/me` resource
zh_cn: 以 `alice` （密码： `alice` ）登录，该用户仅有一个 `User Permission` 可以访问 `/api/users/me` 资源

source: Logout and login as `admin` (password: `admin`) who has both `Admin Permission` to access the `/api/admin` resource and `User Permission` to access the `/api/users/me` resource
zh_cn: 退出并以 `admin` （密码： `admin` ）的身份登录，他同时拥有 `Admin Permission` 以访问 `/api/admin` 资源以及 `User Permission` 以访问 `/api/users/me` 资源

source: Logout and login as `admin` (password: `admin`) who has both `admin` and `user` roles
zh_cn: 退出并以 `admin` （密码： `admin` ）的身份登录，他同时拥有 `admin` 和 `user` 的角色(roles)

source: Look at the return type; it returns a `Uni` of `List<Fruit>`. `Uni` is an asynchronous type. It's a bit like a future. It's a placeholder that will get its value (item) later. When it receives the item (Mutiny says it _emits_ its item), you can attach some behavior. That's how we express the continuation: get a uni, and when the uni emits its item, execute the rest of the processing.
zh_cn: 看看返回类型，它返回 `List<Fruit>` 的 `Uni` 。`Uni` 是一个异步类型。这有点像未来。它是一个占位符，稍后将获得它的值条目 (item) 。当它接收条目(Mutiny说它 _输出_ 的条目)时，你可以附加一些行为。这就是我们表示延续的方式：获取一个uni，当uni输出它的条目时，执行其余的处理。

source: Looking at the data produced by this counter, you can tell how often a negative number was checked, or the number one, or an even number, and so on. Try the following sequence and look for `example_prime_number_total` in the plain text output. Note that the `_total` suffix is added when Micrometer applies Prometheus naming conventions to `example.prime.number`, the originally specified counter name.
zh_cn: 看一下这个counter产生的数据，您可以看到负数或者数字1被或者偶数等被检查的频率。尝试以下命令，并在文本输出中查找 `example_prime_number_total` 。请注意，当Micrometer将Prometheus命名规则应用于 `example.prime.number` ，即最初指定的counter名称时，会添加后缀 `_total` 。

source: MQTT Client
zh_cn: MQTT客户端

source: MS SQL Client
zh_cn: MS SQL客户端

source: Mail Client
zh_cn: 邮件客户端

source: Mailing list index page.
zh_cn: 邮件列表索引页。

source: Maintainer
zh_cn: 维护者

source: Make sure to use the reactive variant
zh_cn: 请确保使用响应式变量

source: Make sure to wrap methods modifying your database (e.g. `entity.persist()`) within a transaction. Marking a CDI bean method `@ReactiveTransactional` will do that for you and make that method a transaction boundary. Alternatively, you can use `Panache.withTransaction()` for the same effect. We recommend doing so at your application entry point boundaries like your REST endpoint controllers.
zh_cn: 请确保修改数据库的方法（例如： `entity.persist()` ）处于同一个事务中。给一个CDI bean方法增加 `@ReactiveTransactional` 注解，可以确保该方法即事务边界。另外，你也可以使用 `Panache.withTransaction()` 来达到同样的效果。我们建议在应用端点的边界这样做，比如REST端点的Controller。

source: Make sure to wrap methods modifying your database (e.g. `entity.persist()`) within a transaction. Marking a CDI bean method `@Transactional` will do that for you and make that method a transaction boundary. We recommend doing so at your application entry point boundaries like your REST endpoint controllers.
zh_cn: 请确保修改数据库的方法（例如： `entity.persist()` ）处于同一个事务中。给一个CDI bean方法增加 `@Transactional` 注解，可以确保该方法即事务边界。我们建议在应用端点的边界这样做，比如REST端点的Controller。

source: Make sure use the documentation to have your questions answered.
zh_cn: 请确保使用文档来寻求问题答案。

source: Make sure you import the reactive variant of `PanacheEntity`.
zh_cn: 确保你导入了 `PanacheEntity` 的响应式类库。

source: Make sure you reference the image you uploaded previously (assumes that a role exists that can be used to run the lambda). Please note that it is not unlikely that for the JVM lambda function, the default memory limit of `128Mb` will not be enough to run the function. In that case, you can increase the memory limit when creating the function by providing the `--memory-size 256` parameter to your `aws lambda create-function` command. You can also adjust the function in the AWS console after you've created it.
zh_cn: 请确保你引用了之前上传的镜像（假设存在一个可以用来运行lambda的角色）。请注意，对于JVM lambda函数来说，默认的 `128Mb` 内存限制不足以运行该函数，这不是不可能的。在这种情况下，你可以在创建函数时通过向 `aws lambda create-function` 命令提供 `--memory-size 256` 参数来增加内存限制。你也可以在创建函数后，在AWS控制台中调整该函数。

source: Make your entities extend `PanacheEntity`: it has an ID field that is auto-generated. If you require a custom ID strategy, you can extend `PanacheEntityBase` instead and handle the ID yourself.
zh_cn: 让你的实体类继承 `PanacheEntity` ：它有一个自动生成的ID字段。如果你需要自定义ID策略，可以继承 `PanacheEntityBase` ，而不用自己处理ID。

source: Make your entities extend `PanacheMongoEntity` (optional if you are using the repository pattern)
zh_cn: 使你的实体继承 `PanacheMongoEntity` （如果你使用资源库模式，则是可选的）。

source: Make your entities extend `PanacheMongoEntity`: it has an ID field that is auto-generated. If you require a custom ID strategy, you can extend `PanacheMongoEntityBase` instead and handle the ID yourself.
zh_cn: 让你的实体继承 `PanacheMongoEntity` ：它有一个自动生成的ID字段。如果你需要一个自定义的ID策略，你可以继承 `PanacheMongoEntityBase` ，而不是自己处理ID。

source: Making `MyWireMockResource` inject the `wireMockServer` field can be done as shown in the `inject` method of the following code snippet:
zh_cn: 为了使 `MyWireMockResource` 注入 `wireMockServer` 字段，可按以下代码片断中的 `inject` 方法进行：

source: Manage your MongoDB schema migrations with Liquibase.
zh_cn: 用Liquibase管理你的MongoDB模式迁移。

source: Managing Proxy Classes
zh_cn: 管理代理类

source: Managing the transactions manually via `entityManager.getTransaction().begin()` and friends lead to a butt ugly code with tons of try catch finally that people get wrong. Transactions are also about JMS and other database access, so one API makes more sense.
zh_cn: 通过 `entityManager.getTransaction().begin()` 和手动管理事务会导致一段丑陋的代码，最终人们会出错。 事务也与 JMS 和其他数据库访问有关，因此一个 API 更有意义。

source: Mandatory
zh_cn: 是否强制

source: Mandrel is a downstream distribution of the Oracle GraalVM CE. Mandrel's main goal is to provide a way to build native executables specifically designed to support Quarkus.
zh_cn: Mandrel是Oracle GraalVM CE的一个下游发行版。Mandrel的主要目标是提供一种方法来构建专门为支持Quarkus而设计的原生可执行文件。

source: Mandrel is built slightly differently to Oracle GraalVM CE, using the standard OpenJDK project. This means that it does not profit from a few small enhancements that Oracle have added to the version of OpenJDK used to build their own GraalVM downloads. These enhancements are omitted because upstream OpenJDK does not manage them, and cannot vouch for. This is particularly important when it comes to conformance and security.
zh_cn: Mandrel的构建方式与Oracle GraalVM CE略有不同，它使用标准的OpenJDK项目。这意味着，Oracle往OpenJDK增加了一些小增强功能，并用于构建Oracle自己的GraalVM，但Mandrel不能从中获益。这些增强功能被省略了，因为它上游的标准OpenJDK并不管理这些特性，也无法提供保障。这一点在涉及到一致性和安全性时尤其重要。

source: Mandrel is built slightly differently to Oracle GraalVM CE, using the standard OpenJDK project. This means that it does not profit from a few small enhancements that Oracle have added to the version of OpenJDK used to build their own GraalVM downloads. This enhancements are omitted because upstream OpenJDK does not manage them, and cannot vouch for. This is particularly important when it comes to conformance and security.
zh_cn: Mandrel的构建方式与Oracle GraalVM CE略有不同，它使用的是标准的OpenJDK项目。这意味着它不能从Oracle对用于构建他们自己的GraalVM下载的OpenJDK版本添加的一些小的增强功能中获益。这些增强功能被省略了，因为上游的OpenJDK并不管理它们，也无法担保。在涉及到一致性和安全性时，这一点尤其重要。

source: Mandrel is recommended for building native executables that target Linux containerized environments. This means that Mandrel users are encouraged to use containers to build their native executables. If you are building native executables for macOS, you should consider using Oracle GraalVM instead, because Mandrel does not currently target this platform. Building native executables directly on bare metal Linux or Windows is possible, with details available in the https://github.com/graalvm/mandrel/blob/default/README.md[Mandrel README] and https://github.com/graalvm/mandrel/releases[Mandrel releases].
zh_cn: Mandrel被推荐用于构建针对Linux容器化环境的原生可执行文件。这意味着，我们鼓励Mandrel用户使用容器来构建他们的原生可执行文件。如果你要为macOS构建本地可执行文件，你应该考虑使用Oracle GraalVM，因为Mandrel目前不针对这个平台。直接在裸机Linux或Windows上构建原生可执行文件是可能的，详情可参见 https://github.com/graalvm/mandrel/blob/default/README.md[Mandrel README] 和 https://github.com/graalvm/mandrel/releases[Mandrel发行版] 。

source: Mandrel or GraalVM installed and xref:building-native-image.adoc#configuring-graalvm[configured appropriately]
zh_cn: 可以安装Mandrel或者GraalVM，并xref:building-native-image.adoc#configuring-graalvm[正确配置]

source: Mandrel releases are built from a code base derived from the upstream Oracle GraalVM CE code base, with only minor changes but some significant exclusions that are not necessary for Quarkus native apps. They support the same capabilities to build native executables as Oracle GraalVM CE, with no significant changes to functionality. Notably, they do not include support for polyglot programming. The reason for these exclusions is to provide a better level of support for the majority of Quarkus users. These exclusions also mean Mandrel offers a considerable reduction in its distribution size when compared with Oracle GraalVM CE/EE.
zh_cn: Mandrel版本的代码库来自于上游的Oracle GraalVM CE代码库，只做了一些小的改动，但也有一些重要的对于Quarkus本地应用程序来说是没有必要的排除项。它们支持与Oracle GraalVM CE相同的构建原生可执行文件的能力，在功能上没有重大变化。值得注意的是，它们不包括对多语言编程的支持。之所以排除这些功能，是为了给大多数Quarkus用户提供更好的支持水平。与Oracle GraalVM CE/EE相比，这些不包括的内容也意味着Mandrel发布的软件包大小大大减小。

source: Manually
zh_cn: 手工

source: Manually using the micro base image
zh_cn: 手动使用微基础镜像

source: Manually using the minimal base image
zh_cn: 手工使用最小基础镜像

source: Mapping Configuration to Objects
zh_cn: 将配置映射到对象

source: Mapping Protected Resources
zh_cn: 映射受保护资源

source: Matching is always done on a longest path wins basis, less specific permission sets are not considered if a more specific one has been matched:
zh_cn: 匹配总是在最长路径胜利的基础上进行，如果已经匹配了更具体的权限集，则不考虑其他模糊的权限集：

source: Matching multiple paths and methods: both win
zh_cn: 匹配多条路径和方法：双赢

source: Matching multiple paths: longest path wins
zh_cn: 匹配多条路径：最长的路径获胜

source: Matching multiple paths: most specific method wins
zh_cn: 匹配多条路径：最具体的方法获胜

source: Matching on paths, methods
zh_cn: 路径、方法的匹配

source: Matching path but not method
zh_cn: 匹配路径但不匹配方法

source: Maven's `sourceDirectory` and `testSourceDirectory` build properties are configured to point to Kotlin sources (`src/main/kotlin` and `src/test/kotlin` respectively)
zh_cn: Maven的 `sourceDirectory` 和 `testSourceDirectory` 构建属性被配置为指向Kotlin代码(分别是： `src/main/kotlin` 和 `src/test/kotlin` )

source: Measuring Performance
zh_cn: 衡量性能

source: Measuring the coverage of your tests
zh_cn: 测量你的测试的覆盖率

source: Messages coming from AMQP contain an instance of `IncomingAmqpMetadata` in the metadata.
zh_cn: 来自AMQP的消息在元数据中包含一个 `IncomingAmqpMetadata` 的实例。

source: Messages transit on *channels*. Application components connect to channels to publish and consume messages. The Kafka connector maps _channels_ to Kafka _topics_.
zh_cn: 信息在 *channels* 上传输。应用程序组件通过连接 channels 来发布和消费消息。Kafka connector将 _channels_ 映射到Kafka的 _topics_上 。

source: Messaging
zh_cn: 消息传递

source: Method parameters can be annotated with the `io.opentelemetry.extension.annotations.SpanAttribute` annotation to indicate which method parameters should be part of the Trace.
zh_cn: 方法参数可以使用 `io.opentelemetry.extension.annotations.SpanAttribute` 注解进行注释，来表示哪些方法参数是包含在Trace中的。

source: Metrics
zh_cn: 指标

source: MicroProfile JWT configuration
zh_cn: MicroProfile JWT配置

source: Micrometer defines a core library providing a registration mechanism for Metrics, and core metric types (Counters, Gauges, Timers, Distribution Summaries, etc.). These core types provide an abstraction layer that can be adapted to different backend monitoring systems. In essence, your application (or a library) can `register` a `Counter`, `Gauge`, `Timer`, or `DistributionSummary` with a `MeterRegistry`. Micrometer will then delegate that registration to one or more implementations, where each implementation handles the unique considerations for the associated monitoring stack.
zh_cn: Micrometer定义了一个核心库为Metrics提供注册机制，以及核心metric类型（Counters、Gauges、Timers、Distribution Summaries等）。这些核心类型提供了一个抽象层，以适应不同的后端监控系统。从本质上讲，您的应用程序（或一个库）可以向 `MeterRegistry` `注册` 一个 `Counter` ， `Gauge` ， `Timer` ，或 `DistributionSummary` 。Micrometer会将该注册委托给一个或多个实现，每个实现都会处理相关监控栈的特定考虑。

source: Micrometer does define two annotations, `@Counted` and `@Timed`, that can be added to methods. The `@Timed` annotation will wrap the execution of a method and will emit the following tags in addition to any tags defined on the annotation itself: class, method, and exception (either "none" or the simple class name of a detected exception).
zh_cn: Micrometer确实也定义了两个注解， `@Counted` 和 `@Timed` ，它们可以被添加到方法中。 `@Timed` 注解将修饰一个方法的执行。除了注解本身定义的标签外，还将添加以下标签：类名、方法名和异常（"none "或检测到的异常的简单类名）。

source: Micrometer is the recommended approach to metrics for Quarkus.
zh_cn: Micrometer是Quarkus推荐的metrics度量库。

source: Micrometer maintains an internal mapping between unique metric identifier and tag combinations and specific meter instances. Using `register`, `counter`, or other methods to increment counters or record values does not create a new instance of a meter unless that combination of identifier and tag/label values hasn't been seen before.
zh_cn: Micrometer在唯一的metric标识和标签组合与对应的meter实例之间维护着一种内部映射关系。使用 `register` , `counter` , 或其他方法来增加counters或记录的数值并不会创建一个新的meter实例，除非该标识符和标记/标签值的组合以前未曾出现过。

source: Micrometer provides a few additional mechanisms for creating gauges. Note that Micrometer does not create strong references to the objects it observes by default. Depending on the registry, Micrometer either omits gauges that observe objects that have been garbage-collected entirely or uses `NaN` (not a number) as the observed value.
zh_cn: Micrometer提供了一些额外的机制来创建gauges。请注意，Micrometer在默认情况下不会对它所观察的对象创建强引用。根据其所在的registry，Micrometer要么完全省略掉观察已经被垃圾收集的对象的gauge，要么使用 `NaN` （not a umber - 不是数字）作为观察值。

source: Micrometer provides an API that allows you to construct your own custom metrics. The most common types of meters supported by monitoring systems are gauges, counters, and summaries. The following sections build an example endpoint, and observes endpoint behavior using these basic meter types.
zh_cn: Micrometer提供了一个API，允许您构建自己的自定义度量。监测系统支持的最常见的meters类型是gauges、counters和summaries。下面的章节构建了一个示例节点，并使用这些基本的meter类型观察节点行为。

source: Micrometer uses `MeterFilter` instances to customize the metrics emitted by `MeterRegistry` instances. The Micrometer extension will detect `MeterFilter` CDI beans and use them when initializing `MeterRegistry` instances.
zh_cn: Micrometer使用 `MeterFilter` 实例来定制 `MeterRegistry` 实例发出的metrics。Micrometer扩展将检测 `MeterFilter` CDI beans，并在初始化 `MeterRegistry` 实例时使用它们。

source: Micrometer uses naming conventions to translate between registered Meters and the conventions used by various backend registries. Meter names, for example, should be created and named using dots to separate segments, `a.name.like.this`. Micrometer then translates that name into the format that the selected registry prefers. Prometheus uses underscores, which means the previous name will appear as `a_name_like_this` in Prometheus-formatted metrics output.
zh_cn: Micrometer使用了一套命名规范来翻译已注册的Meters和各种后端registries使用的规范。例如，Meters名称的创建和命名应使用点来分隔各段，如 `a.name.like.this` 。之后Micrometer会将该名称翻译成所选registries使用的格式。Prometheus使用的是下划线，这意味着之前的名称在Prometheus的格式的metrics输出中会显示为 `a_name_like_this` 。

source: Micrometer will apply Prometheus conventions when emitting metrics for this timer. Prometheus measures time in seconds. Micrometer converts measured durations into seconds and includes the unit in the metric name, per convention. After visiting the prime endpoint a few more times, look in the plain text output for the following three entries: `example_prime_number_test_seconds_count`, `example_prime_number_test_seconds_sum`, and `example_prime_number_test_seconds_max`.
zh_cn: Micrometer在为这个timer发送metrics时将应用Prometheus规范。Prometheus测量时间的单位是秒。Micrometer会将测量的持续时间转换为秒，并按照规范在metric名称中包含单位。再访问几次prime节点后，在文本输出中寻找以下三个条目： `example_prime_number_test_seconds_count` , `example_prime_number_test_seconds_sum` , 和 `example_prime_number_test_seconds_max` 。

source: Microservices tend to come in systems. Let’s now imagine you need to access another HTTP endpoint. You can use an HTTP client directly; this is nothing more than repeating boilerplate code. Quarkus provides a way to call HTTP endpoints easily using the <a href="https://quarkus.io/guides/rest-client">MicroProfile Rest Client API</a>.
zh_cn: 微服务往往是以系统的形式出现的。现在让我们想象一下，你需要访问另一个HTTP端点。你可以直接使用HTTP客户端；这不过是在重复模板代码。Quarkus提供了一种方法，可以使用<a href="https://quarkus.io/guides/rest-client">MicroProfile Rest Client API</a>轻松调用HTTP端点。

source: Migrating from RESTEasy Classic to RESTEasy Reactive
zh_cn: 从RESTEasy 指令式迁移到RESTEasy 响应式

source: Miscellaneous
zh_cn: 杂项

source: Mixing `@QuarkusTest` with other type of tests
zh_cn: 混合使用 `@QuarkusTest` 与其他类型的测试

source: Mixing tests annotated with `@QuarkusTest` with tests annotated with either `@QuarkusDevModeTest`, `@QuarkusProdModeTest` or `@QuarkusUnitTest` is not allowed in a single execution run (in a single Maven Surefire Plugin execution, for instance), while the latter three can coexist.
zh_cn: 在一次执行中（例如在一次Maven Surefire Plugin执行中），将注释为 `@QuarkusTest` 的测试与注释为 `@QuarkusDevModeTest` 、 `@QuarkusProdModeTest` 或 `@QuarkusUnitTest` 的测试混合执行是不被允许的，但是后三者可以共存。

source: Mock Support
zh_cn: Mock支持

source: Mocking
zh_cn: Mock模拟测试

source: Mocking `EntityManager`, `Session` and entity instance methods
zh_cn: 模拟 `EntityManager` , `Session` 及实体类的实例方法

source: Mocking `Mutiny.Session` and entity instance methods
zh_cn: 模拟 `Mutiny.Session` , 及实体类的实例方法

source: Mocking using QuarkusMock
zh_cn: 使用QuarkusMock进行mock

source: Mocking with Panache
zh_cn: 使用Panache mock

source: Modern applications often need to run specific tasks periodically. In this guide, you learn how to schedule periodic tasks.
zh_cn: 现代应用程序经常需要定期运行特定的任务。在本指南中，你将学习如何安排定期任务。

source: Modifying `function.zip`
zh_cn: 修改 `function.zip`

source: MongoDB allows you to configure multiple clients. Using several clients works the same way as having a single client.
zh_cn: MongoDB允许你配置多个客户端。使用多个客户端的方式与拥有一个客户端的方式相同。

source: MongoDB installed or Docker installed
zh_cn: 安装了MongoDB或安装了Docker
